updated the md files
